export const WEATHER_STATUS: Record<number, string> = {
  // Thunderstorm
  200: 'พายุฝนฟ้าคะนอง มีฝนเบาๆ',
  201: 'พายุฝนฟ้าคะนอง มีฝนตก',
  202: 'พายุฝนฟ้าคะนอง มีฝนตกหนัก',
  210: 'พายุฝนฟ้าคะนองเบา',
  211: 'พายุฝนฟ้าคะนอง',
  212: 'พายุฝนฟ้าคะนองรุนแรง',
  221: 'พายุฝนฟ้าคะนองไม่สม่ำเสมอ',
  230: 'พายุฝนฟ้าคะนอง มีฝนปรอยเบา',
  231: 'พายุฝนฟ้าคะนอง มีฝนปรอย',
  232: 'พายุฝนฟ้าคะนอง มีฝนปรอยหนัก',

  // Drizzle
  300: 'ฝนปรอยเบา',
  301: 'ฝนปรอย',
  302: 'ฝนปรอยหนัก',
  310: 'ฝนปรอยผสมเบา',
  311: 'ฝนปรอยผสม',
  312: 'ฝนปรอยผสมหนัก',
  313: 'ฝนตกสลับฝนปรอย',
  314: 'ฝนตกหนักสลับฝนปรอย',
  321: 'ฝนปรอยฝอย',

  // Rain
  500: 'ฝนตกเบา',
  501: 'ฝนตกปานกลาง',
  502: 'ฝนตกหนัก',
  503: 'ฝนตกหนักมาก',
  504: 'ฝนตกหนักผิดปกติ',
  511: 'ฝนเยือกแข็ง',
  520: 'ฝนตกเบาเป็นช่วงๆ',
  521: 'ฝนตกเป็นช่วงๆ',
  522: 'ฝนตกหนักเป็นช่วงๆ',
  531: 'ฝนตกไม่สม่ำเสมอ',

  // Snow
  600: 'หิมะตกเบา',
  601: 'หิมะตก',
  602: 'หิมะตกหนัก',
  611: 'ฝนลูกเห็บ',
  612: 'ฝนลูกเห็บเบาเป็นช่วงๆ',
  613: 'ฝนลูกเห็บเป็นช่วงๆ',
  615: 'ฝนผสมหิมะเบา',
  616: 'ฝนผสมหิมะ',
  620: 'หิมะตกเบาเป็นช่วงๆ',
  621: 'หิมะตกเป็นช่วงๆ',
  622: 'หิมะตกหนักเป็นช่วงๆ',

  // Atmosphere
  701: 'หมอกบาง',
  711: 'ควันหนา',
  721: 'อากาศขุ่นมัว',
  731: 'พายุทรายหรือฝุ่น',
  741: 'หมอกหนา ทัศนวิสัยต่ำ',
  751: 'ทรายฟุ้ง',
  761: 'ฝุ่นฟุ้งกระจาย',
  762: 'เถ้าถ่านจากภูเขาไฟ',
  771: 'พายุลมแรงฉับพลัน',
  781: 'พายุทอร์นาโด',

  // Clear
  800: 'ท้องฟ้าโปร่ง มีแสงอาทิตย์ส่อง',

  // Clouds
  801: 'มีเมฆบางส่วน 11–25%',
  802: 'มีเมฆกระจาย 25–50%',
  803: 'มีเมฆมาก 51–84%',
  804: 'ท้องฟ้ามืดครึ้ม 85–100%',
}
